<template>
    <div class=" flex justify-center  "> 
    
         
        <div class="w-2/5"> 
            <v-list-item-group color="primary">
                <v-list-item v-for="(k, index) in pmtLists" :key="index" > 
                    <v-list-item-content class=" text-xs  py-2 pl-3 my-1 border-2 rounded-xl bg-red-100 border-red-300 "  >
                        <div class="grid grid-cols-7 gap-1">
                            <div class="col-span-2 text-gary-900">
                                {{ k.key }} -{{ k.name}} 
                            </div> 
                        </div>
                    </v-list-item-content>  
                </v-list-item>
            </v-list-item-group>
        </div>

        <div class="w-3/5"> 
            <!-- <v-data-table
             dense
            :headers="hds_Leeeft"
            :items="roadjson"
            item-key="name" 
            :search="search" 
            :items-per-page="30"
            >
            <template v-slot:top>
                <v-text-field
                v-model="search"
                label="搜尋路名"
                class="mx-4"
                ></v-text-field>
            </template>
            <template v-slot:body.append>
                <tr>
                <td></td>
                <td>
                    <v-text-field
                    v-model="calories"
                    type="number"
                    label="Less than"
                    ></v-text-field>
                </td>
                <td colspan="4"></td>
                </tr>
            </template>
            </v-data-table> -->
        </div>
       

    
    
    
    </div>
</template>
 

<script>
import TutorialDetails from "./bkadd4_Mdf";

import SeatDataService from "../services/SeatPrepareService";
// import SeatDataService from "../services/PmtService";
import PmtDataService from "../services/PmtService";
// import logs from '../services/opendata110road.csv'
// import  opdtaRoad  from "./assets/opendata110road.csv";
// https://od.moi.gov.tw/api/v1/rest/datastore/301000000A-000917-035

export default {
    name: "tutorials-list",
    components: { TutorialDetails },


    data() {
        return { 
            show: false,
            pmtLists: [],
            tutorials:[],
            currentTutorial: null,
            currentIndex: -1,

            // - - - - - - -  - - - - - - -

            search: '',
            calories: '',
            // roadjson:logs,
            hds_Left: [ 
                        { text: '名稱', value: 'name' },
                        { text: '消費進度', value: 'calories' }, 
                        // { text: '消費單號', value: 'pmt_sno' },
                        // { text: '收入', value: 'memo' },
                        // { text: '現金', value: 'memo' },
                        // { text: '網銀轉帳', value: 'memo' },
                        // { text: '信用卡', value: 'memo' },
                        // { text: 'LinePay', value: 'memo' },
                        // { text: '動茲券', value: 'memo' },
                    ],
            desserts: [
                        {
                        name: 'Frozen Yogurt',
                        calories: 159,
                        fat: 6.0,
                        carbs: 24,
                        protein: 4.0,
                        iron: '1%',
                        },
                        {
                        name: 'Ice cream sandwich',
                        calories: 237,
                        fat: 9.0,
                        carbs: 37,
                        protein: 4.3,
                        iron: '1%',
                        }
                      ],

            // - - - - - - - - - - - - - -
            hds_Leeeft: [ 
                        { text: '縣市名稱', value: '縣市名稱' },
                        { text: '行政區域名稱', value: '行政區域名稱' }, 
                        { text: '路名', value: '路名' },
                    ],
            roadjson:[
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "三十股路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "三層坪路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "三德路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "三樹路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "中園街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "中山路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "中正路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "中華路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "九份路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "二鬮路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "五寮"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "仁愛街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "介壽路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "佳福路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "信義街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "光明路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "和平街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "國光街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "國學街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "國慶路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "國際一街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "國際二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大仁路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大利路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大勇路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大同路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大埔路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大學路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大德路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大智路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大義路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "大觀路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "學勤路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "學府路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "學成路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "安溪路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "建安"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "弘園街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "復興路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "忠孝街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "愛國路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "成福路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "插角"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "文化路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "新興街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "有木"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "柑樹路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "樟坑湖路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "橫溪路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "正義街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "民族街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "民權街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "民生街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "永安街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "添福"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "清水街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "溪北街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "溪東路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "牛角坑路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "白雞"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "秀川街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "竹安路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "竹崙路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "紫和路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "紫微南路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "紫微路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "紫新路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "金敏"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "長泰街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "長福街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "隆恩街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "頭寮坑路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "鳶峰路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市三峽區",
                            "路名": "龍埔路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "三界公坑"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "三鶯路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "中山路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "中正一路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "中正三路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "中正二路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "中湖街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "二橋新村"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "二橋街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "二甲路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "仁愛路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "信義街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "光復街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "光明街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "光照街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "八德路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "公園街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "南昌街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "南雅路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "和平街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "國中街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "國光街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "國慶街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "國華路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "國際一路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "國際二路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "圳頭坑"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "大湖路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "尖山埔路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "尖山路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "建國路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "德昌二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "德昌街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "忠孝街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "成功街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "文化路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "文昌街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街一棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街七棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街三棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街九棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街二棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街五棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街八棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街六棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "明圓街四棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "晨曦街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "晨曦街一棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "晨曦街三棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "晨曦街二棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "朝陽街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "東湖街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "東湖路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "欣欣街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "欣欣街一棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "欣欣街三棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "欣欣街二棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "欣欣街四棟"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "永利街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "永吉街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "永和街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "永安街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "永昌街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "永明街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "永智街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "永樂街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "永福街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "湖山路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "環河路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "甲一街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "甲三街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "甲二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "甲五街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "福安街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "福德一路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "福德三街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "福德二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "福德五街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "福德四街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "福昌街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "福隆一街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "福隆二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "育德街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "育才街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "育智路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "育樂街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "育英街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "育賢街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "莒光街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "行政路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "西湖街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "重慶街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "陶瓷街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "陽明街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "館前路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "香賓街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "高職南街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "高職東街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "高職西街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳一路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳七路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳三路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳五路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳吉一街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳吉三街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳吉二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳吉五街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳吉四街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳福路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鳳鳴路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鶯桃路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "鶯歌路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "黃厝街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "龍七路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "龍三路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市鶯歌區",
                            "路名": "龍五路"
                        },
  
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "三民路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "中山路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "中正路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "中興路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "互助街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "五權街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "仁化街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "仁愛路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "介壽街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "信義路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "倉後街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "僑中一街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "僑中三街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "僑中二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "光復街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "光明街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "光正街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "光武街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "光環路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "光華街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "公園街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "公館街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "北門街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "區運路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "南興路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "南門街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "南雅南路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "南雅東路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "南雅西路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "博愛街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "合安一路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "合宜一路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "合宜路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "吳鳳路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "和平路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "四川路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "四維路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "國光路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "國慶路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "國泰街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大仁街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大勇街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大同街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大明街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大智街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大東街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大漢街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大華街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大觀路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "大豐街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "太和街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "存德街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "宏國路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "宮口街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "富山街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "實踐路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "干城路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "幸福路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "府中路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "府後街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "廣和街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "廣權路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "建國街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "後埔街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "後菜園街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "復興街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "德興街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "忠孝路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "懷仁街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "懷德街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "成功路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "成都街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "文化路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "文德路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "文新路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "文昌街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "文聖街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "文華街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新崑路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新府路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新月一街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新月三街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新月二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新民街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新海路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新生街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新站路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "新興路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "明德街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "景福路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "智樂路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "東興街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "東門街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "松柏街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "松江街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "板城路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "板新路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "板林路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "林園街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "林森街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "校前街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "樂群路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "正義街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "民享街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "民安街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "民族路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "民有街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "民權路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "民治街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "民生路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "永翠路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "永豐街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "江寧路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "沙崙街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "海山路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "溪北路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "溪城路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "溪崑一街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "溪崑二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "溪頭街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "滿平二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "滿平街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "漢生東路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "漢生西路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "瑞安街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "環河西路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "環漢路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "田單街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "福德街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "稚暉街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "站前路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "篤行路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "綠堤街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "縣民大道"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "翠華街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "自強新村"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "自由路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "英士路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "茶館街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "莊崑路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "莊敬路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "莒光路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "華東街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "華江一路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "華江七路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "華江三路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "華江九路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "華江五路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "華江八路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "華福街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "華興街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "萬安街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "萬板路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "藝文二街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "藝文街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "裕民街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "西門街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "觀光街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "貴興路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "遠東路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "重慶路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "金華街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "金門街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "銘傳街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "長壽街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "長安街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "長江路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "陽明街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "雙十路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "雨農路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "館前東路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "館前西路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "香社一路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "高爾富路"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "龍泉街"
                        },
                        {
                            "縣市名稱": "新北市",
                            "行政區域名稱": "新北市板橋區",
                            "路名": "龍興街"
                        },
                    ],
                      
            
            
        };
    },

    created: function() {
        fetch(
                "https://od.moi.gov.tw/api/v1/rest/datastore/301000000A-000917-035"
            )
            .then((r) => r.json())
            .then((json) => {
                this.roadjson = json;  
            });
    },
    computed: {
      headers () {
        return [
          {
            text: 'Dessert (100g serving)',
            align: 'start',
            sortable: false,
            value: 'name',
          },
          {
            text: 'Calories',
            value: 'calories',
            filter: value => {
              if (!this.calories) return true

              return value < parseInt(this.calories)
            },
          },
          
        //   { text: 'Carbs (g)', value: 'city' },
        //   { text: 'Fat (g)', value: 'site_id' },
        //   { text: 'Protein (g)', value: 'road' }, 
        ]
      },
    },


    methods: { 
        filterOnlyCapsText (value, search, item) {
            return value != null &&
            search != null &&
            typeof value === 'string' &&
            value.toString().toLocaleUpperCase().indexOf(search) !== -1
        },
        pmt_onDataChange(items) { 
            let _tansCATM = [];
            items.forEach((item) => {
                let key = item.key;
                let data = item.val();
                _tansCATM.push({ 
                    key: key,
                    name: data.name, 
                });
            }); 
            this.pmtLists = _tansCATM;
        }, 

        refreshList() {
            this.currentTutorial = null;
            this.currentIndex = -1;
        },

        setActiveTutorial(tutorial, index) {

            this.currentTutorial = tutorial;
            this.currentIndex = index;

            if (this.copyRight_N != false) {
                this.currentTutorial.tmp_idx = this.bch_tmp_idx;
                this.bch_updta();
                this.message = "複製更新 成功!";
            }

            if (this.copyRight_T != false) {
                this.currentTutorial.left_time = this.bch_left_time;
                this.bch_updta();
                this.message = "複製更新 成功!";
            }

            if (this.copyRight_M != false) {
                this.currentTutorial.memo = this.bch_memo;
                this.bch_updta();
                this.message = "複製更新 成功!";
            }
        },

        bch_updta() {
            const data = {
                tmp_idx: this.currentTutorial.tmp_idx,
                left_time: this.currentTutorial.left_time,
                memo: this.currentTutorial.memo,
            };

            SeatDataService.update(this.currentTutorial.key, data)
                .then(() => {
                    this.message = "更新成功!";
                })
                .catch((e) => {
                    console.log(e);
                });
        } 
        // reSet_bch_N(){ if(this.copyRight_N == false) { this.bch_left_time = ""; }  },
        // reSet_bch_T(){ if(this.copyRight_T == false) { this.bch_tmp_idx = ""  ; }  },
        , 
        reSet_pos_0() {

            for (let index = 0; index <= 100; index++) {

                this.setActiveTutorial(this.tutorials[index], index);
                this.reSetOne(this.tutorials[index], index);
            }
            this.dialog.value = false;

        },
        reSet_pos_1() {

            for (let index = 0; index <= 30; index++) {

                this.setActiveTutorial(this.tutorials[index], index);
                this.reSetOne(this.tutorials[index], index);


            }
            this.dialog.value = false;

        },

        reSet_pos_2() {

            for (let index = 31; index <= 100; index++) {

                this.setActiveTutorial(this.tutorials[index], index);
                this.reSetOne(this.tutorials[index], index);

            }
            this.dialog.value = false;

        },

        reSetOne(tutorial, index) {

            this.currentTutorial = tutorial;
            this.currentIndex = index;

            this.currentTutorial.tmp_idx = "";
            this.currentTutorial.left_time = "";
            this.currentTutorial.memo = "";

            const data = {
                tmp_idx: "",
                left_time: "",
                memo: "",
            };

            SeatDataService.update(this.currentTutorial.key, data)
                .then(() => {
                    this.message = "更新成功!";
                })
                .catch((e) => {
                    console.log(e);
                });
        },

        removeAllTutorials() {
            SeatDataService.deleteAll()
                .then(() => {
                    this.refreshList();
                })
                .catch((e) => {
                    console.log(e);
                });
        },


    },
    mounted() {
        // console.log(_tutorials.title);  
        // SeatDataService.getAll().on("value", this.onDataChange);
        PmtDataService.getAll().on("value", this.pmt_onDataChange);
    },
    beforeDestroy() {
        SeatDataService.getAll().off("value", this.onDataChange);
    },


};
</script>

<style>
/* .submit-form {
  max-width: 300px;
  margin: auto;
} */
</style>


<style>
.list {
    text-align: left;
    max-width: 750px;
    margin: auto;
}
</style>
